app/controllers/admin/videos_controller.rb

  def create
    @video = Video.create(video_params)
---
INSERT INTO "videos" ("category_id", "created_at", "description", "large_cover", "small_cover", "title", "updated_at", "video_url") VALUES (?, ?, ?, ?, ?, ?, ?, ?)