app/views/relationships/index.html.haml

SELECT COUNT(*) FROM "relationships"  WHERE "relationships"."leader_id" = ?  [["leader_id", 2]]
---
            %td.extra-padding= relationship.leader.queue_items.count
            %td.extra-padding= relationship.leader.leading_relationships.count