app/views/users/show.html.haml

                %td
                  = link_to queue_item.video.categories.first.name, category_path(queue_item.video.categories.first)
---
SELECT  "videos".* FROM "videos"  WHERE "videos"."id" = ? LIMIT 1  [["id", 2]]