app/views/videos/index.html.haml

SELECT "videos".* FROM "videos"  WHERE "videos"."category_id" = ?  [["category_id", 1]]
---
    .videos.row
      - category.recent_videos.each do |video|
        .videos.col-sm-2