app/controllers/forgot_passwords_controller.rb

SELECT  "users".* FROM "users"  WHERE "users"."email" = 'sdkjh@example.com'  ORDER BY "users"."id" ASC LIMIT 1
---
  def create
    user = User.where(email: params[:email]).first