app/controllers/invitations_controller.rb

  def create
    if search_for_user_email
      invite = create_invitation
      if invite.save
---
INSERT INTO "invitations" ("created_at", "inviter_id", "message", "recipient_email", "recipient_name", "token", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)