app/controllers/password_resets_controller.rb

  def show
    user = User.where(token: params[:id]).first
---
SELECT  "users".* FROM "users"  WHERE "users"."token" = 'zlQiiatZG8WN6ZHgiaY8gQ'  ORDER BY "users"."id" ASC LIMIT 1

  def create
    user = User.where(token: params[:token]).first

    if user
      user.password = params[:password]
      user.generate_token
      user.save
---
SELECT  "users".* FROM "users"  WHERE "users"."token" = 'zlQiiatZG8WN6ZHgiaY8gQ'  ORDER BY "users"."id" ASC LIMIT 1
UPDATE "users" SET "password_digest" = ?, "token" = ?, "updated_at" = ? WHERE "users"."id" = 1  [["password_digest", "$2a$10$kOQ.UyoM2BJIuIsQYnzuiOc9G00zRwgzHfOCV4RHhzk0jrcJk/ncK"], ["token", "zUxvX2HQSDNE5f016gPBGg"], ["updated_at", "2014-07-16 16:10:46.417822"]]