app/controllers/queue_items_controller.rb

  def create
    video = Video.find_by_id(params[:video_id])
    QueueItem.create(video: video, user: current_user, position: current_user.queue_items.count + 1) unless current_user.queue_items.map { |n| n.video }.include?(video)
---
SELECT  "videos".* FROM "videos"  WHERE "videos"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "queue_items" ("created_at", "position", "updated_at", "user_id", "video_id") VALUES (?, ?, ?, ?, ?)  [["created_at", "2014-07-07 15:25:47.152062"], ["position", 1], ["updated_at", "2014-07-07 15:25:47.152062"], ["user_id", 1], ["video_id", 1]]
SELECT "queue_items".* FROM "queue_items"  WHERE "queue_items"."user_id" = ?  [["user_id", 1]]
SELECT COUNT(*) FROM "queue_items"  WHERE "queue_items"."user_id" = ?  [["user_id", 1]]

  def destroy
    queue_item = QueueItem.find(params[:id])
    queue_item.destroy if current_user.queue_items.include?(queue_item)
---
SELECT  "queue_items".* FROM "queue_items"  WHERE "queue_items"."id" = ? LIMIT 1  [["id", 2]]
DELETE FROM "queue_items" WHERE "queue_items"."id" = ?  [["id", 2]]
SELECT  1 AS one FROM "queue_items"  WHERE "queue_items"."user_id" = ? AND "queue_items"."id" = 2 LIMIT 1  [["user_id", 1]]