app/controllers/relationships_controller.rb

SELECT  "users".* FROM "users"  WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "relationships" ("created_at", "follower_id", "leader_id", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", "2014-07-14 18:25:54.971639"], ["follower_id", 1], ["leader_id", 2], ["updated_at", "2014-07-14 18:25:54.971639"]]
---
  def create
    user = User.find(params[:user_id])
    Relationship.create(follower_id: current_user.id, leader_id: params[:user_id]) if current_user.allow_to_follow?(user)

DELETE FROM "relationships" WHERE "relationships"."id" = ?  [["id", 2]]
---
  def destroy
    relationship = Relationship.where(follower_id: current_user.id, leader_id: params[:id]).first
    relationship.destroy if relationship