app/controllers/relationships_controller.rb

SELECT  "relationships".* FROM "relationships"  WHERE "relationships"."id" = ? LIMIT 1  [["id", 2]]
---
  def destroy
    relationship = Relationship.find(params[:id])