app/controllers/reviews_controller.rb

  def create
    @video = Video.find(params[:video_id])
---
SELECT  "videos".* FROM "videos"  WHERE "videos"."id" = ? LIMIT 1  [["id", 1]]