app/controllers/users_controller.rb

  def create
    @user = User.create(user_params)
---
INSERT INTO "users" ("created_at", "email", "full_name", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", "2014-06-28 20:10:53.942107"], ["email", "michael@mail.com"], ["full_name", "Michael Brown"], ["updated_at", "2014-06-28 20:10:53.942107"]]