app/controllers/users_controller.rb

SELECT  "invitations".* FROM "invitations"  WHERE "invitations"."token" = '4zB2JRwlPFCIAiB4ythzSw'  ORDER BY "invitations"."id" ASC LIMIT 1
---
  def new_with_invitation_token
    invitation = Invitation.where(token: params[:token]).first