app/controllers/videos_controller.rb

  def set_video
    @video = Video.find(params[:id])
---
SELECT "videos".* FROM "videos"  WHERE (title LIKE '%pulp%')  ORDER BY created_at DESC