app/controllers/videos_controller.rb

SELECT "categories".* FROM "categories"
---
	def index
		#@videos = Video.all
		@categories = Category.all