app/views/categories/show.html.haml

  .videos.row
    - @category.videos.each do |video|
---
SELECT "videos".* FROM "videos"  WHERE "videos"."category_id" = ?  [["category_id", 1]]