app/views/admin/videos/new.html.haml

SELECT "categories".* FROM "categories"
---
            = f.text_field :title
            = f.select :category_id, options_for_select(Category.all.map{|cat|[cat.name, cat.id]})